TestCases/PoolBoiling_01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          488;
        startFace       2700;
    }
    Top
    {
        type            patch;
        nFaces          100;
        startFace       3188;
    }
    Heater
    {
        type            patch;
        nFaces          12;
        startFace       3288;
    }
)

// ************************************************************************* //
