TestCases/PoolBoiling_01/0/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    Walls
    {
        type            constantAlphaContactAngle;
        theta0          60;
        limit           gradient;
        value           uniform 1;
    }
    Top
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    Heater
    {
        type            constantAlphaContactAngle;
        theta0          60;
        limit           gradient;
        value           uniform 1;
    }
}


// ************************************************************************* //
